rksdna/stm8s/stm8s_registers.h
/*
 * stm8s - STM8 SDCC cooperative multitasking operating system
 * Copyright (c) 2022 rksdna
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#ifndef STM8S_REGISTERS_H
#define STM8S_REGISTERS_H

#include "stm8s_types.h"

struct stm8s_gpio
{
    volatile u8_t ODR;
    volatile u8_t IDR;
    volatile u8_t DDR;
    volatile u8_t CR1;
    volatile u8_t CR2;
};

#define GPIOA ((struct stm8s_gpio*)0x5000)
#define GPIOB ((struct stm8s_gpio*)0x5005)
#define GPIOC ((struct stm8s_gpio*)0x500A)
#define GPIOD ((struct stm8s_gpio*)0x500F)
#define GPIOE ((struct stm8s_gpio*)0x5014)
#define GPIOF ((struct stm8s_gpio*)0x5019)
#define GPIOG ((struct stm8s_gpio*)0x501E)
#define GPIOH ((struct stm8s_gpio*)0x5023)
#define GPIOI ((struct stm8s_gpio*)0x5028)

struct stm8s_adc1
{
    volatile u8_t DB0RH;
    volatile u8_t DB0RL;
    volatile u8_t DB1RH;
    volatile u8_t DB1RL;
    volatile u8_t DB2RH;
    volatile u8_t DB2RL;
    volatile u8_t DB3RH;
    volatile u8_t DB3RL;
    volatile u8_t DB4RH;
    volatile u8_t DB4RL;
    volatile u8_t DB5RH;
    volatile u8_t DB5RL;
    volatile u8_t DB6RH;
    volatile u8_t DB6RL;
    volatile u8_t DB7RH;
    volatile u8_t DB7RL;
    volatile u8_t DB8RH;
    volatile u8_t DB8RL;
    volatile u8_t DB9RH;
    volatile u8_t DB9RL;
    u8_t RESERVED[12];
    volatile u8_t CSR;
    volatile u8_t CR1;
    volatile u8_t CR2;
    volatile u8_t CR3;
    volatile u8_t DRH;
    volatile u8_t DRL;
    volatile u8_t TDRH;
    volatile u8_t TDRL;
    volatile u8_t HTRH;
    volatile u8_t HTRL;
    volatile u8_t LTRH;
    volatile u8_t LTRL;
    volatile u8_t AWSRH;
    volatile u8_t AWSRL;
    volatile u8_t AWCRH;
    volatile u8_t AWCRL;
};

#define ADC1 ((struct stm8s_adc1*)0x53E0)

#define ADC1_CSR_EOC ((u8_t)0x80)
#define ADC1_CSR_AWD ((u8_t)0x40)
#define ADC1_CSR_EOCIE ((u8_t)0x20)
#define ADC1_CSR_AWDIE ((u8_t)0x10)
#define ADC1_CSR_CH ((u8_t)0x0F)

#define ADC1_CR1_SPSEL ((u8_t)0x70)
#define ADC1_CR1_CONT ((u8_t)0x02)
#define ADC1_CR1_ADON ((u8_t)0x01)

#define ADC1_CR2_EXTTRIG ((u8_t)0x40)
#define ADC1_CR2_EXTSEL ((u8_t)0x30)
#define ADC1_CR2_ALIGN ((u8_t)0x08)
#define ADC1_CR2_SCAN ((u8_t)0x02)
#define ADC1_CR3_DBUF ((u8_t)0x80)
#define ADC1_CR3_OVR ((u8_t)0x40)

struct stm8s_adc2
{
    volatile u8_t CSR;
    volatile u8_t CR1;
    volatile u8_t CR2;
    u8_t RESERVED;
    volatile u8_t DRH;
    volatile u8_t DRL;
    volatile u8_t TDRH;
    volatile u8_t TDRL;
};

#define ADC2 ((struct stm8s_adc2*)0x5400)

#define ADC2_CSR_EOC ((u8_t)0x80)
#define ADC2_CSR_EOCIE ((u8_t)0x20)
#define ADC2_CSR_CH ((u8_t)0x0F)

#define ADC2_CR1_SPSEL ((u8_t)0x70)
#define ADC2_CR1_CONT ((u8_t)0x02)
#define ADC2_CR1_ADON ((u8_t)0x01)
#define ADC2_CR2_EXTTRIG ((u8_t)0x40)
#define ADC2_CR2_EXTSEL ((u8_t)0x30)
#define ADC2_CR2_ALIGN ((u8_t)0x08)

struct stm8s_awu
{
    volatile u8_t CSR;
    volatile u8_t APR;
    volatile u8_t TBR;
};

#define AWU ((struct stm8s_awu*)0x50F0)


#define AWU_CSR_AWUF ((u8_t)0x20)
#define AWU_CSR_AWUEN ((u8_t)0x10)
#define AWU_CSR_MSR ((u8_t)0x01)

#define AWU_APR_APR ((u8_t)0x3F)

#define AWU_TBR_AWUTB ((u8_t)0x0F)

struct stm8s_beep
{
    volatile u8_t CSR;
};

#define BEEP ((struct stm8s_beep*)0x50F3)

#define BEEP_CSR_BEEPSEL ((u8_t)0xC0)
#define BEEP_CSR_BEEPEN ((u8_t)0x20)
#define BEEP_CSR_BEEPDIV ((u8_t)0x1F)

struct stm8s_clk
{
    volatile u8_t ICKR;
    volatile u8_t ECKR;
    u8_t RESERVED;
    volatile u8_t CMSR;
    volatile u8_t SWR;
    volatile u8_t SWCR;
    volatile u8_t CKDIVR;
    volatile u8_t PCKENR1;
    volatile u8_t CSSR;
    volatile u8_t CCOR;
    volatile u8_t PCKENR2;
    u8_t RESERVED1;
    volatile u8_t HSITRIMR;
    volatile u8_t SWIMCCR;
};

#define CLK ((struct stm8s_clk*)0x50C0)

#define CLK_ICKR_SWUAH ((u8_t)0x20)
#define CLK_ICKR_LSIRDY ((u8_t)0x10)
#define CLK_ICKR_LSIEN ((u8_t)0x08)
#define CLK_ICKR_FHWU ((u8_t)0x04)
#define CLK_ICKR_HSIRDY ((u8_t)0x02)
#define CLK_ICKR_HSIEN ((u8_t)0x01)

#define CLK_ECKR_HSERDY ((u8_t)0x02)
#define CLK_ECKR_HSEEN ((u8_t)0x01)

#define CLK_CMSR_CKM ((u8_t)0xFF)

#define CLK_SWR_SWI ((u8_t)0xFF)

#define CLK_SWCR_SWIF ((u8_t)0x08)
#define CLK_SWCR_SWIEN ((u8_t)0x04)
#define CLK_SWCR_SWEN ((u8_t)0x02)
#define CLK_SWCR_SWBSY ((u8_t)0x01)

#define CLK_CKDIVR_HSIDIV ((u8_t)0x18)
#define CLK_CKDIVR_CPUDIV ((u8_t)0x07)

#define CLK_PCKENR1_TIM1 ((u8_t)0x80)
#define CLK_PCKENR1_TIM3 ((u8_t)0x40)
#define CLK_PCKENR1_TIM2 ((u8_t)0x20)
#define CLK_PCKENR1_TIM5 ((u8_t)0x20)
#define CLK_PCKENR1_TIM4 ((u8_t)0x10)
#define CLK_PCKENR1_TIM6 ((u8_t)0x10)
#define CLK_PCKENR1_UART3 ((u8_t)0x08)
#define CLK_PCKENR1_UART2 ((u8_t)0x08)
#define CLK_PCKENR1_UART1 ((u8_t)0x04)
#define CLK_PCKENR1_SPI ((u8_t)0x02)

#define CLK_PCKENR1_I2C ((u8_t)0x01)
#define CLK_PCKENR2_CAN ((u8_t)0x80)
#define CLK_PCKENR2_ADC ((u8_t)0x08)
#define CLK_PCKENR2_AWU ((u8_t)0x04)

#define CLK_CSSR_CSSD ((u8_t)0x08)
#define CLK_CSSR_CSSDIE ((u8_t)0x04)
#define CLK_CSSR_AUX ((u8_t)0x02)
#define CLK_CSSR_CSSEN ((u8_t)0x01)

#define CLK_CCOR_CCOBSY ((u8_t)0x40)
#define CLK_CCOR_CCORDY ((u8_t)0x20)
#define CLK_CCOR_CCOSEL ((u8_t)0x1E)
#define CLK_CCOR_CCOEN ((u8_t)0x01)

#define CLK_HSITRIMR_HSITRIM ((u8_t)0x07)
#define CLK_SWIMCCR_SWIMDIV ((u8_t)0x01)

struct stm8s_tim1
{
    volatile u8_t CR1;
    volatile u8_t CR2;
    volatile u8_t SMCR;
    volatile u8_t ETR;
    volatile u8_t IER;
    volatile u8_t SR1;
    volatile u8_t SR2;
    volatile u8_t EGR;
    volatile u8_t CCMR1;
    volatile u8_t CCMR2;
    volatile u8_t CCMR3;
    volatile u8_t CCMR4;
    volatile u8_t CCER1;
    volatile u8_t CCER2;
    volatile u8_t CNTRH;
    volatile u8_t CNTRL;
    volatile u8_t PSCRH;
    volatile u8_t PSCRL;
    volatile u8_t ARRH;
    volatile u8_t ARRL;
    volatile u8_t RCR;
    volatile u8_t CCR1H;
    volatile u8_t CCR1L;
    volatile u8_t CCR2H;
    volatile u8_t CCR2L;
    volatile u8_t CCR3H;
    volatile u8_t CCR3L;
    volatile u8_t CCR4H;
    volatile u8_t CCR4L;
    volatile u8_t BKR;
    volatile u8_t DTR;
    volatile u8_t OISR;
};

#define TIM1 ((struct stm8s_tim1*) 0x5250)

#define TIM1_CR1_ARPE ((u8_t)0x80)
#define TIM1_CR1_CMS ((u8_t)0x60)
#define TIM1_CR1_DIR ((u8_t)0x10)
#define TIM1_CR1_OPM ((u8_t)0x08)
#define TIM1_CR1_URS ((u8_t)0x04)
#define TIM1_CR1_UDIS ((u8_t)0x02)
#define TIM1_CR1_CEN ((u8_t)0x01)

