rksdna/stm8s/stm8s_registers.h
#define TIM1_CR2_TI1S ((u8_t)0x80)
#define TIM1_CR2_MMS ((u8_t)0x70)
#define TIM1_CR2_COMS ((u8_t)0x04)
#define TIM1_CR2_CCPC ((u8_t)0x01)

#define TIM1_SMCR_MSM ((u8_t)0x80)
#define TIM1_SMCR_TS ((u8_t)0x70)
#define TIM1_SMCR_SMS ((u8_t)0x07)

#define TIM1_ETR_ETP ((u8_t)0x80)
#define TIM1_ETR_ECE ((u8_t)0x40)
#define TIM1_ETR_ETPS ((u8_t)0x30)
#define TIM1_ETR_ETF ((u8_t)0x0F)

#define TIM1_IER_BIE ((u8_t)0x80)
#define TIM1_IER_TIE ((u8_t)0x40)
#define TIM1_IER_COMIE ((u8_t)0x20)
#define TIM1_IER_CC4IE ((u8_t)0x10)
#define TIM1_IER_CC3IE ((u8_t)0x08)
#define TIM1_IER_CC2IE ((u8_t)0x04)
#define TIM1_IER_CC1IE ((u8_t)0x02)
#define TIM1_IER_UIE ((u8_t)0x01)

#define TIM1_SR1_BIF ((u8_t)0x80)
#define TIM1_SR1_TIF ((u8_t)0x40)
#define TIM1_SR1_COMIF ((u8_t)0x20)
#define TIM1_SR1_CC4IF ((u8_t)0x10)
#define TIM1_SR1_CC3IF ((u8_t)0x08)
#define TIM1_SR1_CC2IF ((u8_t)0x04)
#define TIM1_SR1_CC1IF ((u8_t)0x02)
#define TIM1_SR1_UIF ((u8_t)0x01)

#define TIM1_SR2_CC4OF ((u8_t)0x10)
#define TIM1_SR2_CC3OF ((u8_t)0x08)
#define TIM1_SR2_CC2OF ((u8_t)0x04)
#define TIM1_SR2_CC1OF ((u8_t)0x02)

#define TIM1_EGR_BG ((u8_t)0x80)
#define TIM1_EGR_TG ((u8_t)0x40)
#define TIM1_EGR_COMG ((u8_t)0x20)
#define TIM1_EGR_CC4G ((u8_t)0x10)
#define TIM1_EGR_CC3G ((u8_t)0x08)
#define TIM1_EGR_CC2G ((u8_t)0x04)
#define TIM1_EGR_CC1G ((u8_t)0x02)
#define TIM1_EGR_UG ((u8_t)0x01)

#define TIM1_CCMR_ICxPSC ((u8_t)0x0C)
#define TIM1_CCMR_ICxF ((u8_t)0xF0)
#define TIM1_CCMR_OCM ((u8_t)0x70)
#define TIM1_CCMR_OCxPE ((u8_t)0x08)
#define TIM1_CCMR_OCxFE ((u8_t)0x04)
#define TIM1_CCMR_CCxS ((u8_t)0x03)

#define CCMR_TIxDirect_Set ((u8_t)0x01)

#define TIM1_CCER1_CC2NP ((u8_t)0x80)
#define TIM1_CCER1_CC2NE ((u8_t)0x40)
#define TIM1_CCER1_CC2P ((u8_t)0x20)
#define TIM1_CCER1_CC2E ((u8_t)0x10)
#define TIM1_CCER1_CC1NP ((u8_t)0x08)
#define TIM1_CCER1_CC1NE ((u8_t)0x04)
#define TIM1_CCER1_CC1P ((u8_t)0x02)
#define TIM1_CCER1_CC1E ((u8_t)0x01)

#define TIM1_CCER2_CC4P ((u8_t)0x20)
#define TIM1_CCER2_CC4E ((u8_t)0x10)
#define TIM1_CCER2_CC3NP ((u8_t)0x08)
#define TIM1_CCER2_CC3NE ((u8_t)0x04)
#define TIM1_CCER2_CC3P ((u8_t)0x02)
#define TIM1_CCER2_CC3E ((u8_t)0x01)

#define TIM1_CNTRH_CNT ((u8_t)0xFF)
#define TIM1_CNTRL_CNT ((u8_t)0xFF)

#define TIM1_PSCH_PSC ((u8_t)0xFF)

#define TIM1_PSCL_PSC ((u8_t)0xFF)

#define TIM1_ARRH_ARR ((u8_t)0xFF)

#define TIM1_ARRL_ARR ((u8_t)0xFF)

#define TIM1_RCR_REP ((u8_t)0xFF)

#define TIM1_CCR1H_CCR1 ((u8_t)0xFF)

#define TIM1_CCR1L_CCR1 ((u8_t)0xFF)

#define TIM1_CCR2H_CCR2 ((u8_t)0xFF)

#define TIM1_CCR2L_CCR2 ((u8_t)0xFF)

#define TIM1_CCR3H_CCR3 ((u8_t)0xFF)

#define TIM1_CCR3L_CCR3 ((u8_t)0xFF)

#define TIM1_CCR4H_CCR4 ((u8_t)0xFF)

#define TIM1_CCR4L_CCR4 ((u8_t)0xFF)

#define TIM1_BKR_MOE ((u8_t)0x80)
#define TIM1_BKR_AOE ((u8_t)0x40)
#define TIM1_BKR_BKP ((u8_t)0x20)
#define TIM1_BKR_BKE ((u8_t)0x10)
#define TIM1_BKR_OSSR ((u8_t)0x08)
#define TIM1_BKR_OSSI ((u8_t)0x04)
#define TIM1_BKR_LOCK ((u8_t)0x03)

#define TIM1_DTR_DTG ((u8_t)0xFF)

#define TIM1_OISR_OIS4 ((u8_t)0x40)
#define TIM1_OISR_OIS3N ((u8_t)0x20)
#define TIM1_OISR_OIS3 ((u8_t)0x10)
#define TIM1_OISR_OIS2N ((u8_t)0x08)
#define TIM1_OISR_OIS2 ((u8_t)0x04)
#define TIM1_OISR_OIS1N ((u8_t)0x02)
#define TIM1_OISR_OIS1 ((u8_t)0x01)

struct stm8s_tim2
{
    volatile u8_t CR1;
#if defined(STM8S103) || defined(STM8S003)
    u8_t RESERVED1;
    u8_t RESERVED2;
#endif
    volatile u8_t IER;
    volatile u8_t SR1;
    volatile u8_t SR2;
    volatile u8_t EGR;
    volatile u8_t CCMR1;
    volatile u8_t CCMR2;
    volatile u8_t CCMR3;
    volatile u8_t CCER1;
    volatile u8_t CCER2;
    volatile u8_t CNTRH;
    volatile u8_t CNTRL;
    volatile u8_t PSCR;
    volatile u8_t ARRH;
    volatile u8_t ARRL;
    volatile u8_t CCR1H;
    volatile u8_t CCR1L;
    volatile u8_t CCR2H;
    volatile u8_t CCR2L;
    volatile u8_t CCR3H;
    volatile u8_t CCR3L;
};

#define TIM2 ((struct stm8s_tim2*) 0x5300)

#define TIM2_CR1_ARPE ((u8_t)0x80)
#define TIM2_CR1_OPM ((u8_t)0x08)
#define TIM2_CR1_URS ((u8_t)0x04)
#define TIM2_CR1_UDIS ((u8_t)0x02)
#define TIM2_CR1_CEN ((u8_t)0x01)

#define TIM2_IER_CC3IE ((u8_t)0x08)
#define TIM2_IER_CC2IE ((u8_t)0x04)
#define TIM2_IER_CC1IE ((u8_t)0x02)
#define TIM2_IER_UIE ((u8_t)0x01)

#define TIM2_SR1_CC3IF ((u8_t)0x08)
#define TIM2_SR1_CC2IF ((u8_t)0x04)
#define TIM2_SR1_CC1IF ((u8_t)0x02)
#define TIM2_SR1_UIF ((u8_t)0x01)

#define TIM2_SR2_CC3OF ((u8_t)0x08)
#define TIM2_SR2_CC2OF ((u8_t)0x04)
#define TIM2_SR2_CC1OF ((u8_t)0x02)

#define TIM2_EGR_CC3G ((u8_t)0x08)
#define TIM2_EGR_CC2G ((u8_t)0x04)
#define TIM2_EGR_CC1G ((u8_t)0x02)
#define TIM2_EGR_UG ((u8_t)0x01)

#define TIM2_CCMR_ICxPSC ((u8_t)0x0C)
#define TIM2_CCMR_ICxF ((u8_t)0xF0)
#define TIM2_CCMR_OCM ((u8_t)0x70)
#define TIM2_CCMR_OCxPE ((u8_t)0x08)
#define TIM2_CCMR_CCxS ((u8_t)0x03)

#define TIM2_CCER1_CC2P ((u8_t)0x20)
#define TIM2_CCER1_CC2E ((u8_t)0x10)
#define TIM2_CCER1_CC1P ((u8_t)0x02)
#define TIM2_CCER1_CC1E ((u8_t)0x01)

#define TIM2_CCER2_CC3P ((u8_t)0x02)
#define TIM2_CCER2_CC3E ((u8_t)0x01)

#define TIM2_CNTRH_CNT ((u8_t)0xFF)
#define TIM2_CNTRL_CNT ((u8_t)0xFF)

#define TIM2_PSCR_PSC ((u8_t)0xFF)

#define TIM2_ARRH_ARR ((u8_t)0xFF)
#define TIM2_ARRL_ARR ((u8_t)0xFF)

#define TIM2_CCR1H_CCR1 ((u8_t)0xFF)

#define TIM2_CCR1L_CCR1 ((u8_t)0xFF)

#define TIM2_CCR2H_CCR2 ((u8_t)0xFF)

#define TIM2_CCR2L_CCR2 ((u8_t)0xFF)

#define TIM2_CCR3H_CCR3 ((u8_t)0xFF)

#define TIM2_CCR3L_CCR3 ((u8_t)0xFF)

struct stm8s_tim3
{
    volatile u8_t CR1;
    volatile u8_t IER;
    volatile u8_t SR1;
    volatile u8_t SR2;
    volatile u8_t EGR;
    volatile u8_t CCMR1;
    volatile u8_t CCMR2;
    volatile u8_t CCER1;
    volatile u8_t CNTRH;
    volatile u8_t CNTRL;
    volatile u8_t PSCR;
    volatile u8_t ARRH;
    volatile u8_t ARRL;
    volatile u8_t CCR1H;
    volatile u8_t CCR1L;
    volatile u8_t CCR2H;
    volatile u8_t CCR2L;
};

#define TIM3 ((struct stm8s_tim3*) 0x5320)

#define TIM3_CR1_ARPE ((u8_t)0x80)
#define TIM3_CR1_OPM ((u8_t)0x08)
#define TIM3_CR1_URS ((u8_t)0x04)
#define TIM3_CR1_UDIS ((u8_t)0x02)
#define TIM3_CR1_CEN ((u8_t)0x01)

