rksdna/stm8s/stm8s_registers.h
#define TIM3_IER_CC2IE ((u8_t)0x04)
#define TIM3_IER_CC1IE ((u8_t)0x02)
#define TIM3_IER_UIE ((u8_t)0x01)

#define TIM3_SR1_CC2IF ((u8_t)0x04)
#define TIM3_SR1_CC1IF ((u8_t)0x02)
#define TIM3_SR1_UIF ((u8_t)0x01)

#define TIM3_SR2_CC2OF ((u8_t)0x04)
#define TIM3_SR2_CC1OF ((u8_t)0x02)

#define TIM3_EGR_CC2G ((u8_t)0x04)
#define TIM3_EGR_CC1G ((u8_t)0x02)
#define TIM3_EGR_UG ((u8_t)0x01)

#define TIM3_CCMR_ICxPSC ((u8_t)0x0C)
#define TIM3_CCMR_ICxF ((u8_t)0xF0)
#define TIM3_CCMR_OCM ((u8_t)0x70)
#define TIM3_CCMR_OCxPE ((u8_t)0x08)
#define TIM3_CCMR_CCxS ((u8_t)0x03)

#define TIM3_CCER1_CC2P ((u8_t)0x20)
#define TIM3_CCER1_CC2E ((u8_t)0x10)
#define TIM3_CCER1_CC1P ((u8_t)0x02)
#define TIM3_CCER1_CC1E ((u8_t)0x01)

#define TIM3_CNTRH_CNT ((u8_t)0xFF)

#define TIM3_CNTRL_CNT ((u8_t)0xFF)

#define TIM3_PSCR_PSC ((u8_t)0xFF)

#define TIM3_ARRH_ARR ((u8_t)0xFF)

#define TIM3_ARRL_ARR ((u8_t)0xFF)

#define TIM3_CCR1H_CCR1 ((u8_t)0xFF)

#define TIM3_CCR1L_CCR1 ((u8_t)0xFF)

#define TIM3_CCR2H_CCR2 ((u8_t)0xFF)

#define TIM3_CCR2L_CCR2 ((u8_t)0xFF)

struct stm8s_tim4
{
    volatile u8_t CR1;
#if defined(STM8S103) || defined(STM8S003)
    u8_t RESERVED1;
    u8_t RESERVED2;
#endif
    volatile u8_t IER;
    volatile u8_t SR1;
    volatile u8_t EGR;
    volatile u8_t CNTR;
    volatile u8_t PSCR;
    volatile u8_t ARR;
};

#define TIM4 ((struct stm8s_tim4*) 0x5340)

#define TIM4_CR1_ARPE ((u8_t)0x80)
#define TIM4_CR1_OPM ((u8_t)0x08)
#define TIM4_CR1_URS ((u8_t)0x04)
#define TIM4_CR1_UDIS ((u8_t)0x02)
#define TIM4_CR1_CEN ((u8_t)0x01)

#define TIM4_IER_UIE ((u8_t)0x01)

#define TIM4_SR1_UIF ((u8_t)0x01)

#define TIM4_EGR_UG ((u8_t)0x01)

#define TIM4_CNTR_CNT ((u8_t)0xFF)

#define TIM4_PSCR_PSC ((u8_t)0x07)

#define TIM4_ARR_ARR ((u8_t)0xFF)

struct stm8s_tim5
{
    volatile u8_t CR1;
    volatile u8_t CR2;
    volatile u8_t SMCR;
    volatile u8_t IER;
    volatile u8_t SR1;
    volatile u8_t SR2;
    volatile u8_t EGR;
    volatile u8_t CCMR1;
    volatile u8_t CCMR2;
    volatile u8_t CCMR3;
    volatile u8_t CCER1;
    volatile u8_t CCER2;
    volatile u8_t CNTRH;
    volatile u8_t CNTRL;
    volatile u8_t PSCR;
    volatile u8_t ARRH;
    volatile u8_t ARRL;
    volatile u8_t CCR1H;
    volatile u8_t CCR1L;
    volatile u8_t CCR2H;
    volatile u8_t CCR2L;
    volatile u8_t CCR3H;
    volatile u8_t CCR3L;
};

#define TIM5 ((struct stm8s_tim5*) 0x5300)

#define TIM5_CR1_ARPE ((u8_t)0x80)
#define TIM5_CR1_OPM ((u8_t)0x08)
#define TIM5_CR1_URS ((u8_t)0x04)
#define TIM5_CR1_UDIS ((u8_t)0x02)
#define TIM5_CR1_CEN ((u8_t)0x01)

#define TIM5_CR2_TI1S ((u8_t)0x80)
#define TIM5_CR2_MMS ((u8_t)0x70)

#define TIM5_SMCR_MSM ((u8_t)0x80)
#define TIM5_SMCR_TS ((u8_t)0x70)
#define TIM5_SMCR_SMS ((u8_t)0x07)

#define TIM5_IER_TIE ((u8_t)0x40)
#define TIM5_IER_CC3IE ((u8_t)0x08)
#define TIM5_IER_CC2IE ((u8_t)0x04)
#define TIM5_IER_CC1IE ((u8_t)0x02)
#define TIM5_IER_UIE ((u8_t)0x01)

#define TIM5_SR1_TIF ((u8_t)0x40)
#define TIM5_SR1_CC3IF ((u8_t)0x08)
#define TIM5_SR1_CC2IF ((u8_t)0x04)
#define TIM5_SR1_CC1IF ((u8_t)0x02)
#define TIM5_SR1_UIF ((u8_t)0x01)

#define TIM5_SR2_CC3OF ((u8_t)0x08)
#define TIM5_SR2_CC2OF ((u8_t)0x04)
#define TIM5_SR2_CC1OF ((u8_t)0x02)

#define TIM5_EGR_TG ((u8_t)0x40)
#define TIM5_EGR_CC3G ((u8_t)0x08)
#define TIM5_EGR_CC2G ((u8_t)0x04)
#define TIM5_EGR_CC1G ((u8_t)0x02)
#define TIM5_EGR_UG ((u8_t)0x01)

#define TIM5_CCMR_ICxPSC ((u8_t)0x0C)
#define TIM5_CCMR_ICxF ((u8_t)0xF0)
#define TIM5_CCMR_OCM ((u8_t)0x70)
#define TIM5_CCMR_OCxPE ((u8_t)0x08)
#define TIM5_CCMR_CCxS ((u8_t)0x03)
#define TIM5_CCMR_TIxDirect_Set ((u8_t)0x01)

#define TIM5_CCER1_CC2P ((u8_t)0x20)
#define TIM5_CCER1_CC2E ((u8_t)0x10)
#define TIM5_CCER1_CC1P ((u8_t)0x02)
#define TIM5_CCER1_CC1E ((u8_t)0x01)

#define TIM5_CCER2_CC3P ((u8_t)0x02)
#define TIM5_CCER2_CC3E ((u8_t)0x01)

#define TIM5_CNTRH_CNT ((u8_t)0xFF)

#define TIM5_CNTRL_CNT ((u8_t)0xFF)

#define TIM5_PSCR_PSC ((u8_t)0xFF)

#define TIM5_ARRH_ARR ((u8_t)0xFF)

#define TIM5_ARRL_ARR ((u8_t)0xFF)

#define TIM5_CCR1H_CCR1 ((u8_t)0xFF)

#define TIM5_CCR1L_CCR1 ((u8_t)0xFF)

#define TIM5_CCR2H_CCR2 ((u8_t)0xFF)

#define TIM5_CCR2L_CCR2 ((u8_t)0xFF)

#define TIM5_CCR3H_CCR3 ((u8_t)0xFF)

#define TIM5_CCR3L_CCR3 ((u8_t)0xFF)

struct stm8s_tim6
{
    volatile u8_t CR1;
    volatile u8_t CR2;
    volatile u8_t SMCR;
    volatile u8_t IER;
    volatile u8_t SR1;
    volatile u8_t EGR;
    volatile u8_t CNTR;
    volatile u8_t PSCR;
    volatile u8_t ARR;
};

#define TIM6 ((struct stm8s_tim6*) 0x5340)

#define TIM6_CR1_ARPE ((u8_t)0x80)
#define TIM6_CR1_OPM ((u8_t)0x08)
#define TIM6_CR1_URS ((u8_t)0x04)
#define TIM6_CR1_UDIS ((u8_t)0x02)
#define TIM6_CR1_CEN ((u8_t)0x01)

#define TIM6_CR2_MMS ((u8_t)0x70)

#define TIM6_SMCR_MSM ((u8_t)0x80)
#define TIM6_SMCR_TS ((u8_t)0x70)
#define TIM6_SMCR_SMS ((u8_t)0x07)

#define TIM6_IER_TIE ((u8_t)0x40)
#define TIM6_IER_UIE ((u8_t)0x01)

#define TIM6_SR1_TIF ((u8_t)0x40)
#define TIM6_SR1_UIF ((u8_t)0x01)

#define TIM6_EGR_TG ((u8_t)0x40)
#define TIM6_EGR_UG ((u8_t)0x01)

#define TIM6_CNTR_CNT ((u8_t)0xFF)

#define TIM6_PSCR_PSC ((u8_t)0x07)

#define TIM6_ARR_ARR ((u8_t)0xFF)

struct stm8s_i2c
{
    volatile u8_t CR1;
    volatile u8_t CR2;
    volatile u8_t FREQR;
    volatile u8_t OARL;
    volatile u8_t OARH;
    u8_t RESERVED1;
    volatile u8_t DR;
    volatile u8_t SR1;
    volatile u8_t SR2;
    volatile u8_t SR3;
    volatile u8_t ITR;
    volatile u8_t CCRL;
    volatile u8_t CCRH;
    volatile u8_t TRISER;
    u8_t RESERVED2;
};

#define I2C ((struct stm8s_i2c*) 0x5210)

#define I2C_CR1_NOSTRETCH ((u8_t)0x80)
#define I2C_CR1_ENGC ((u8_t)0x40)
#define I2C_CR1_PE ((u8_t)0x01)

#define I2C_CR2_SWRST ((u8_t)0x80)
#define I2C_CR2_POS ((u8_t)0x08)
#define I2C_CR2_ACK ((u8_t)0x04)
#define I2C_CR2_STOP ((u8_t)0x02)
#define I2C_CR2_START ((u8_t)0x01)

#define I2C_FREQR_FREQ ((u8_t)0x3F)

#define I2C_OARL_ADD ((u8_t)0xFE)
#define I2C_OARL_ADD0 ((u8_t)0x01)

#define I2C_OARH_ADDMODE ((u8_t)0x80)
#define I2C_OARH_ADDCONF ((u8_t)0x40)
#define I2C_OARH_ADD ((u8_t)0x06)

#define I2C_DR_DR ((u8_t)0xFF)

#define I2C_SR1_TXE ((u8_t)0x80)
#define I2C_SR1_RXNE ((u8_t)0x40)
#define I2C_SR1_STOPF ((u8_t)0x10)
#define I2C_SR1_ADD10 ((u8_t)0x08)
#define I2C_SR1_BTF ((u8_t)0x04)
#define I2C_SR1_ADDR ((u8_t)0x02)
#define I2C_SR1_SB ((u8_t)0x01)

#define I2C_SR2_WUFH ((u8_t)0x20)
#define I2C_SR2_OVR ((u8_t)0x08)
#define I2C_SR2_AF ((u8_t)0x04)
#define I2C_SR2_ARLO ((u8_t)0x02)
#define I2C_SR2_BERR ((u8_t)0x01)

