rksdna/stm8s/stm8s_registers.h
#define I2C_SR3_GENCALL ((u8_t)0x10)
#define I2C_SR3_TRA ((u8_t)0x04)
#define I2C_SR3_BUSY ((u8_t)0x02)
#define I2C_SR3_MSL ((u8_t)0x01)

#define I2C_ITR_ITBUFEN ((u8_t)0x04)
#define I2C_ITR_ITEVTEN ((u8_t)0x02)
#define I2C_ITR_ITERREN ((u8_t)0x01)

#define I2C_CCRL_CCR ((u8_t)0xFF)

#define I2C_CCRH_FS ((u8_t)0x80)
#define I2C_CCRH_DUTY ((u8_t)0x40)
#define I2C_CCRH_CCR ((u8_t)0x0F)

#define I2C_TRISER_TRISE ((u8_t)0x3F)

struct stm8s_itc
{
    volatile u8_t ISPR1;
    volatile u8_t ISPR2;
    volatile u8_t ISPR3;
    volatile u8_t ISPR4;
    volatile u8_t ISPR5;
    volatile u8_t ISPR6;
    volatile u8_t ISPR7;
    volatile u8_t ISPR8;
};

#define ITC ((struct stm8s_itc*) 0x7F70)

#define CPU_CC_I1I0 ((u8_t)0x28)

struct stm8s_exti
{
    volatile u8_t CR1;
    volatile u8_t CR2;
};

#define EXTI ((struct stm8s_exti*)0x50A0)

#define EXTI_CR1_PDIS ((u8_t)0xC0)
#define EXTI_CR1_PCIS ((u8_t)0x30)
#define EXTI_CR1_PBIS ((u8_t)0x0C)
#define EXTI_CR1_PAIS ((u8_t)0x03)

#define EXTI_CR2_TLIS ((u8_t)0x04)
#define EXTI_CR2_PEIS ((u8_t)0x03)

struct stm8s_flash
{
    volatile u8_t CR1;
    volatile u8_t CR2;
    volatile u8_t NCR2;
    volatile u8_t FPR;
    volatile u8_t NFPR;
    volatile u8_t IAPSR;
    u8_t RESERVED1;
    u8_t RESERVED2;
    volatile u8_t PUKR;
    u8_t RESERVED3;
    volatile u8_t DUKR;
};

#define FLASH ((struct stm8s_flash*)0x505A)

#define FLASH_CR1_HALT ((u8_t)0x08)
#define FLASH_CR1_AHALT ((u8_t)0x04)
#define FLASH_CR1_IE ((u8_t)0x02)
#define FLASH_CR1_FIX ((u8_t)0x01)

#define FLASH_CR2_OPT ((u8_t)0x80)
#define FLASH_CR2_WPRG ((u8_t)0x40)
#define FLASH_CR2_ERASE ((u8_t)0x20)
#define FLASH_CR2_FPRG ((u8_t)0x10)
#define FLASH_CR2_PRG ((u8_t)0x01)

#define FLASH_NCR2_NOPT ((u8_t)0x80)
#define FLASH_NCR2_NWPRG ((u8_t)0x40)
#define FLASH_NCR2_NERASE ((u8_t)0x20)
#define FLASH_NCR2_NFPRG ((u8_t)0x10)
#define FLASH_NCR2_NPRG ((u8_t)0x01)

#define FLASH_IAPSR_HVOFF ((u8_t)0x40)
#define FLASH_IAPSR_DUL ((u8_t)0x08)
#define FLASH_IAPSR_EOP ((u8_t)0x04)
#define FLASH_IAPSR_PUL ((u8_t)0x02)
#define FLASH_IAPSR_WR_PG_DIS ((u8_t)0x01)

#define FLASH_PUKR_PUK ((u8_t)0xFF)

#define FLASH_DUKR_DUK ((u8_t)0xFF)

struct stm8s_opt
{
    volatile u8_t OPT0;
    volatile u8_t OPT1;
    volatile u8_t NOPT1;
    volatile u8_t OPT2;
    volatile u8_t NOPT2;
    volatile u8_t OPT3;
    volatile u8_t NOPT3;
    volatile u8_t OPT4;
    volatile u8_t NOPT4;
    volatile u8_t OPT5;
    volatile u8_t NOPT5;
    u8_t RESERVED1;
    u8_t RESERVED2;
    volatile u8_t OPT7;
    volatile u8_t NOPT7;
};

#define OPT ((struct stm8s_opt*)0x4800)

struct stm8s_iwdg
{
    volatile u8_t KR;
    volatile u8_t PR;
    volatile u8_t RLR;
};

#define IWDG ((struct stm8s_iwdg*) 0x50E0)

struct stm8s_wwdg
{
    volatile u8_t CR;
    volatile u8_t WR;
};

#define WWDG ((struct stm8s_wwdg*) 0x50D1)

#define WWDG_CR_WDGA ((u8_t)0x80)
#define WWDG_CR_T6 ((u8_t)0x40)
#define WWDG_CR_T ((u8_t)0x7F)

#define WWDG_WR_MSB ((u8_t)0x80)
#define WWDG_WR_W ((u8_t)0x7F)

struct stm8s_rst
{
    volatile u8_t SR;
};

#define RST ((struct stm8s_rst*) 0x50B3)

#define RST_SR_EMCF ((u8_t)0x10)
#define RST_SR_SWIMF ((u8_t)0x08)
#define RST_SR_ILLOPF ((u8_t)0x04)
#define RST_SR_IWDGF ((u8_t)0x02)
#define RST_SR_WWDGF ((u8_t)0x01)

struct stm8s_spi
{
    volatile u8_t CR1;
    volatile u8_t CR2;
    volatile u8_t ICR;
    volatile u8_t SR;
    volatile u8_t DR;
    volatile u8_t CRCPR;
    volatile u8_t RXCRCR;
    volatile u8_t TXCRCR;
};

#define SPI ((struct stm8s_spi*) 0x5200)

#define SPI_CR1_LSBFIRST ((u8_t)0x80)
#define SPI_CR1_SPE ((u8_t)0x40)
#define SPI_CR1_BR ((u8_t)0x38)
#define SPI_CR1_MSTR ((u8_t)0x04)
#define SPI_CR1_CPOL ((u8_t)0x02)
#define SPI_CR1_CPHA ((u8_t)0x01)

#define SPI_CR2_BDM ((u8_t)0x80)
#define SPI_CR2_BDOE ((u8_t)0x40)
#define SPI_CR2_CRCEN ((u8_t)0x20)
#define SPI_CR2_CRCNEXT ((u8_t)0x10)
#define SPI_CR2_RXONLY ((u8_t)0x04)
#define SPI_CR2_SSM ((u8_t)0x02)
#define SPI_CR2_SSI ((u8_t)0x01)

#define SPI_ICR_TXEI ((u8_t)0x80)
#define SPI_ICR_RXEI ((u8_t)0x40)
#define SPI_ICR_ERRIE ((u8_t)0x20)
#define SPI_ICR_WKIE ((u8_t)0x10)

#define SPI_SR_BSY ((u8_t)0x80)
#define SPI_SR_OVR ((u8_t)0x40)
#define SPI_SR_MODF ((u8_t)0x20)
#define SPI_SR_CRCERR ((u8_t)0x10)
#define SPI_SR_WKUP ((u8_t)0x08)
#define SPI_SR_TXE ((u8_t)0x02)
#define SPI_SR_RXNE ((u8_t)0x01)

struct stm8s_uart1
{
    volatile u8_t SR;
    volatile u8_t DR;
    volatile u8_t BRR1;
    volatile u8_t BRR2;
    volatile u8_t CR1;
    volatile u8_t CR2;
    volatile u8_t CR3;
    volatile u8_t CR4;
    volatile u8_t CR5;
    volatile u8_t GTR;
    volatile u8_t PSCR;
};

#define UART1 ((struct stm8s_uart1*) 0x5230)

#define UART1_SR_TXE ((u8_t)0x80)
#define UART1_SR_TC ((u8_t)0x40)
#define UART1_SR_RXNE ((u8_t)0x20)
#define UART1_SR_IDLE ((u8_t)0x10)
#define UART1_SR_OR ((u8_t)0x08)
#define UART1_SR_NF ((u8_t)0x04)
#define UART1_SR_FE ((u8_t)0x02)
#define UART1_SR_PE ((u8_t)0x01)

#define UART1_BRR1_DIVM ((u8_t)0xFF)

#define UART1_BRR2_DIVM ((u8_t)0xF0)
#define UART1_BRR2_DIVF ((u8_t)0x0F)

#define UART1_CR1_R8 ((u8_t)0x80)
#define UART1_CR1_T8 ((u8_t)0x40)
#define UART1_CR1_UARTD ((u8_t)0x20)
#define UART1_CR1_M ((u8_t)0x10)
#define UART1_CR1_WAKE ((u8_t)0x08)
#define UART1_CR1_PCEN ((u8_t)0x04)
#define UART1_CR1_PS ((u8_t)0x02)
#define UART1_CR1_PIEN ((u8_t)0x01)

#define UART1_CR2_TIEN ((u8_t)0x80)
#define UART1_CR2_TCIEN ((u8_t)0x40)
#define UART1_CR2_RIEN ((u8_t)0x20)
#define UART1_CR2_ILIEN ((u8_t)0x10)
#define UART1_CR2_TEN ((u8_t)0x08)
#define UART1_CR2_REN ((u8_t)0x04)
#define UART1_CR2_RWU ((u8_t)0x02)
#define UART1_CR2_SBK ((u8_t)0x01)

#define UART1_CR3_LINEN ((u8_t)0x40)
#define UART1_CR3_STOP ((u8_t)0x30)
#define UART1_CR3_CKEN ((u8_t)0x08)
#define UART1_CR3_CPOL ((u8_t)0x04)
#define UART1_CR3_CPHA ((u8_t)0x02)
#define UART1_CR3_LBCL ((u8_t)0x01)

#define UART1_CR4_LBDIEN ((u8_t)0x40)
#define UART1_CR4_LBDL ((u8_t)0x20)
#define UART1_CR4_LBDF ((u8_t)0x10)
#define UART1_CR4_ADD ((u8_t)0x0F)

#define UART1_CR5_SCEN ((u8_t)0x20)
#define UART1_CR5_NACK ((u8_t)0x10)
#define UART1_CR5_HDSEL ((u8_t)0x08)
#define UART1_CR5_IRLP ((u8_t)0x04)
#define UART1_CR5_IREN ((u8_t)0x02)

