rksdna/stm8s/stm8s_registers.h
struct stm8s_uart2
{
    volatile u8_t SR;
    volatile u8_t DR;
    volatile u8_t BRR1;
    volatile u8_t BRR2;
    volatile u8_t CR1;
    volatile u8_t CR2;
    volatile u8_t CR3;
    volatile u8_t CR4;
    volatile u8_t CR5;
    volatile u8_t CR6;
    volatile u8_t GTR;
    volatile u8_t PSCR;
};

#define UART2 ((struct stm8s_uart2*) 0x5240)

#define UART2_SR_TXE ((u8_t)0x80)
#define UART2_SR_TC ((u8_t)0x40)
#define UART2_SR_RXNE ((u8_t)0x20)
#define UART2_SR_IDLE ((u8_t)0x10)
#define UART2_SR_OR ((u8_t)0x08)
#define UART2_SR_NF ((u8_t)0x04)
#define UART2_SR_FE ((u8_t)0x02)
#define UART2_SR_PE ((u8_t)0x01)

#define UART2_BRR1_DIVM ((u8_t)0xFF)

#define UART2_BRR2_DIVM ((u8_t)0xF0)
#define UART2_BRR2_DIVF ((u8_t)0x0F)

#define UART2_CR1_R8 ((u8_t)0x80)
#define UART2_CR1_T8 ((u8_t)0x40)
#define UART2_CR1_UARTD ((u8_t)0x20)
#define UART2_CR1_M ((u8_t)0x10)
#define UART2_CR1_WAKE ((u8_t)0x08)
#define UART2_CR1_PCEN ((u8_t)0x04)
#define UART2_CR1_PS ((u8_t)0x02)
#define UART2_CR1_PIEN ((u8_t)0x01)

#define UART2_CR2_TIEN ((u8_t)0x80)
#define UART2_CR2_TCIEN ((u8_t)0x40)
#define UART2_CR2_RIEN ((u8_t)0x20)
#define UART2_CR2_ILIEN ((u8_t)0x10)
#define UART2_CR2_TEN ((u8_t)0x08)
#define UART2_CR2_REN ((u8_t)0x04)
#define UART2_CR2_RWU ((u8_t)0x02)
#define UART2_CR2_SBK ((u8_t)0x01)

#define UART2_CR3_LINEN ((u8_t)0x40)
#define UART2_CR3_STOP ((u8_t)0x30)
#define UART2_CR3_CKEN ((u8_t)0x08)
#define UART2_CR3_CPOL ((u8_t)0x04)
#define UART2_CR3_CPHA ((u8_t)0x02)
#define UART2_CR3_LBCL ((u8_t)0x01)

#define UART2_CR4_LBDIEN ((u8_t)0x40)
#define UART2_CR4_LBDL ((u8_t)0x20)
#define UART2_CR4_LBDF ((u8_t)0x10)
#define UART2_CR4_ADD ((u8_t)0x0F)

#define UART2_CR5_SCEN ((u8_t)0x20)
#define UART2_CR5_NACK ((u8_t)0x10)
#define UART2_CR5_HDSEL ((u8_t)0x08)
#define UART2_CR5_IRLP ((u8_t)0x04)
#define UART2_CR5_IREN ((u8_t)0x02)

#define UART2_CR6_LDUM ((u8_t)0x80)
#define UART2_CR6_LSLV ((u8_t)0x20)
#define UART2_CR6_LASE ((u8_t)0x10)
#define UART2_CR6_LHDIEN ((u8_t)0x04)
#define UART2_CR6_LHDF ((u8_t)0x02)
#define UART2_CR6_LSF ((u8_t)0x01)

struct stm8s_uart3
{
    volatile u8_t SR;
    volatile u8_t DR;
    volatile u8_t BRR1;
    volatile u8_t BRR2;
    volatile u8_t CR1;
    volatile u8_t CR2;
    volatile u8_t CR3;
    volatile u8_t CR4;
    u8_t RESERVED;
    volatile u8_t CR6;
};

#define UART3 ((struct stm8s_uart3*) 0x5240)

#define UART3_SR_TXE ((u8_t)0x80)
#define UART3_SR_TC ((u8_t)0x40)
#define UART3_SR_RXNE ((u8_t)0x20)
#define UART3_SR_IDLE ((u8_t)0x10)
#define UART3_SR_OR ((u8_t)0x08)
#define UART3_SR_NF ((u8_t)0x04)
#define UART3_SR_FE ((u8_t)0x02)
#define UART3_SR_PE ((u8_t)0x01)

#define UART3_BRR1_DIVM ((u8_t)0xFF)

#define UART3_BRR2_DIVM ((u8_t)0xF0)
#define UART3_BRR2_DIVF ((u8_t)0x0F)

#define UART3_CR1_R8 ((u8_t)0x80)
#define UART3_CR1_T8 ((u8_t)0x40)
#define UART3_CR1_UARTD ((u8_t)0x20)
#define UART3_CR1_M ((u8_t)0x10)
#define UART3_CR1_WAKE ((u8_t)0x08)
#define UART3_CR1_PCEN ((u8_t)0x04)
#define UART3_CR1_PS ((u8_t)0x02)
#define UART3_CR1_PIEN ((u8_t)0x01)

#define UART3_CR2_TIEN ((u8_t)0x80)
#define UART3_CR2_TCIEN ((u8_t)0x40)
#define UART3_CR2_RIEN ((u8_t)0x20)
#define UART3_CR2_ILIEN ((u8_t)0x10)
#define UART3_CR2_TEN ((u8_t)0x08)
#define UART3_CR2_REN ((u8_t)0x04)
#define UART3_CR2_RWU ((u8_t)0x02)
#define UART3_CR2_SBK ((u8_t)0x01)

#define UART3_CR3_LINEN ((u8_t)0x40)
#define UART3_CR3_STOP ((u8_t)0x30)

#define UART3_CR4_LBDIEN ((u8_t)0x40)
#define UART3_CR4_LBDL ((u8_t)0x20)
#define UART3_CR4_LBDF ((u8_t)0x10)
#define UART3_CR4_ADD ((u8_t)0x0F)

#define UART3_CR6_LDUM ((u8_t)0x80)
#define UART3_CR6_LSLV ((u8_t)0x20)
#define UART3_CR6_LASE ((u8_t)0x10)
#define UART3_CR6_LHDIEN ((u8_t)0x04)
#define UART3_CR6_LHDF ((u8_t)0x02)
#define UART3_CR6_LSF ((u8_t)0x01)

struct stm8s_can
{
    volatile u8_t MCR;
    volatile u8_t MSR;
    volatile u8_t TSR;
    volatile u8_t TPR;
    volatile u8_t RFR;
    volatile u8_t IER;
    volatile u8_t DGR;
    volatile u8_t PSR;
    union
    {
        struct
        {
            volatile u8_t MCSR;
            volatile u8_t MDLCR;
            volatile u8_t MIDR1;
            volatile u8_t MIDR2;
            volatile u8_t MIDR3;
            volatile u8_t MIDR4;
            volatile u8_t MDAR1;
            volatile u8_t MDAR2;
            volatile u8_t MDAR3;
            volatile u8_t MDAR4;
            volatile u8_t MDAR5;
            volatile u8_t MDAR6;
            volatile u8_t MDAR7;
            volatile u8_t MDAR8;
            volatile u8_t MTSRL;
            volatile u8_t MTSRH;
        } TXB;
        struct
        {
            volatile u8_t FR01;
            volatile u8_t FR02;
            volatile u8_t FR03;
            volatile u8_t FR04;
            volatile u8_t FR05;
            volatile u8_t FR06;
            volatile u8_t FR07;
            volatile u8_t FR08;
            volatile u8_t FR09;
            volatile u8_t FR10;
            volatile u8_t FR11;
            volatile u8_t FR12;
            volatile u8_t FR13;
            volatile u8_t FR14;
            volatile u8_t FR15;
            volatile u8_t FR16;
        } F;
        struct
        {
            volatile u8_t F0R1;
            volatile u8_t F0R2;
            volatile u8_t F0R3;
            volatile u8_t F0R4;
            volatile u8_t F0R5;
            volatile u8_t F0R6;
            volatile u8_t F0R7;
            volatile u8_t F0R8;
            volatile u8_t F1R1;
            volatile u8_t F1R2;
            volatile u8_t F1R3;
            volatile u8_t F1R4;
            volatile u8_t F1R5;
            volatile u8_t F1R6;
            volatile u8_t F1R7;
            volatile u8_t F1R8;
        } F01;
        struct
        {
            volatile u8_t F2R1;
            volatile u8_t F2R2;
            volatile u8_t F2R3;
            volatile u8_t F2R4;
            volatile u8_t F2R5;
            volatile u8_t F2R6;
            volatile u8_t F2R7;
            volatile u8_t F2R8;
            volatile u8_t F3R1;
            volatile u8_t F3R2;
            volatile u8_t F3R3;
            volatile u8_t F3R4;
            volatile u8_t F3R5;
            volatile u8_t F3R6;
            volatile u8_t F3R7;
            volatile u8_t F3R8;
        } F23;
        struct
        {
            volatile u8_t F4R1;
            volatile u8_t F4R2;
            volatile u8_t F4R3;
            volatile u8_t F4R4;
            volatile u8_t F4R5;
            volatile u8_t F4R6;
            volatile u8_t F4R7;
            volatile u8_t F4R8;
            volatile u8_t F5R1;
            volatile u8_t F5R2;
            volatile u8_t F5R3;
            volatile u8_t F5R4;
            volatile u8_t F5R5;
            volatile u8_t F5R6;
            volatile u8_t F5R7;
            volatile u8_t F5R8;
        } F45;
        struct
        {
            volatile u8_t ESR;
            volatile u8_t EIER;
            volatile u8_t TECR;
            volatile u8_t RECR;
            volatile u8_t BTR1;
            volatile u8_t BTR2;
            u8_t RESERVED1[2];
            volatile u8_t FMR1;
            volatile u8_t FMR2;
            volatile u8_t FCR1;
            volatile u8_t FCR2;
            volatile u8_t FCR3;
            u8_t RESERVED2[3];
        } CFG;
        struct
        {
            volatile u8_t MFMI;
            volatile u8_t MDLCR;
            volatile u8_t MIDR1;
            volatile u8_t MIDR2;
            volatile u8_t MIDR3;
            volatile u8_t MIDR4;
            volatile u8_t MDAR1;
            volatile u8_t MDAR2;
            volatile u8_t MDAR3;
            volatile u8_t MDAR4;
            volatile u8_t MDAR5;
            volatile u8_t MDAR6;
            volatile u8_t MDAR7;
            volatile u8_t MDAR8;
            volatile u8_t MTSRL;
            volatile u8_t MTSRH;
        } RXF;
    } P;
};

#define CAN ((struct stm8s_can*) 0x5420)

#define CAN_MCR_INRQ ((u8_t)0x01)
#define CAN_MCR_SLEEP ((u8_t)0x02)
#define CAN_MCR_TXFP ((u8_t)0x04)
#define CAN_MCR_RFLM ((u8_t)0x08)
#define CAN_MCR_NART ((u8_t)0x10)
#define CAN_MCR_AWUM ((u8_t)0x20)
#define CAN_MCR_ABOM ((u8_t)0x40)
#define CAN_MCR_TTCM ((u8_t)0x80)

#define CAN_MSR_INAK ((u8_t)0x01)
#define CAN_MSR_SLAK ((u8_t)0x02)
#define CAN_MSR_ERRI ((u8_t)0x04)
#define CAN_MSR_WKUI ((u8_t)0x08)
#define CAN_MSR_TX ((u8_t)0x10)
#define CAN_MSR_RX ((u8_t)0x20)

#define CAN_TSR_RQCP0 ((u8_t)0x01)
#define CAN_TSR_RQCP1 ((u8_t)0x02)
#define CAN_TSR_RQCP2 ((u8_t)0x04)
#define CAN_TSR_RQCP012 ((u8_t)0x07)
#define CAN_TSR_TXOK0 ((u8_t)0x10)
#define CAN_TSR_TXOK1 ((u8_t)0x20)
#define CAN_TSR_TXOK2 ((u8_t)0x40)

#define CAN_TPR_CODE0 ((u8_t)0x01)
#define CAN_TPR_TME0 ((u8_t)0x04)
#define CAN_TPR_TME1 ((u8_t)0x08)
#define CAN_TPR_TME2 ((u8_t)0x10)
#define CAN_TPR_LOW0 ((u8_t)0x20)
#define CAN_TPR_LOW1 ((u8_t)0x40)
#define CAN_TPR_LOW2 ((u8_t)0x80)

#define CAN_RFR_FMP01 ((u8_t)0x03)
#define CAN_RFR_FULL ((u8_t)0x08)
#define CAN_RFR_FOVR ((u8_t)0x10)
#define CAN_RFR_RFOM ((u8_t)0x20)

#define CAN_IER_TMEIE ((u8_t)0x01)
#define CAN_IER_FMPIE ((u8_t)0x02)
#define CAN_IER_FFIE ((u8_t)0x04)
#define CAN_IER_FOVIE ((u8_t)0x08)
#define CAN_IER_WKUIE ((u8_t)0x80)

#define CAN_DGR_LBKM ((u8_t)0x01)
#define CAN_DGR_SLIM ((u8_t)0x02)
#define CAN_DGR_SAMP ((u8_t)0x04)
#define CAN_DGR_RX ((u8_t)0x08)
#define CAN_DGR_TXM2E ((u8_t)0x10)

#define CAN_PSR_PS0 ((u8_t)0x01)
#define CAN_PSR_PS1 ((u8_t)0x02)
#define CAN_PSR_PS2 ((u8_t)0x04)

#define CAN_MCSR_TXRQ ((u8_t)0x01)
#define CAN_MCSR_ABRQ ((u8_t)0x02)
#define CAN_MCSR_RQCP ((u8_t)0x04)
#define CAN_MCSR_TXOK ((u8_t)0x08)
#define CAN_MCSR_ALST ((u8_t)0x10)
#define CAN_MCSR_TERR ((u8_t)0x20)

