rksdna/stm8s/stm8s_registers.h
#define CAN_MDLCR_DLC ((u8_t)0x0F)
#define CAN_MDLCR_TGT ((u8_t)0x80)

#define CAN_MIDR1_RTR ((u8_t)0x20)
#define CAN_MIDR1_IDE ((u8_t)0x40)

#define CAN_ESR_EWGF ((u8_t)0x01)
#define CAN_ESR_EPVF ((u8_t)0x02)
#define CAN_ESR_BOFF ((u8_t)0x04)
#define CAN_ESR_LEC0 ((u8_t)0x10)
#define CAN_ESR_LEC1 ((u8_t)0x20)
#define CAN_ESR_LEC2 ((u8_t)0x40)
#define CAN_ESR_LEC ((u8_t)0x70)

#define CAN_EIER_EWGIE ((u8_t)0x01)
#define CAN_EIER_EPVIE ((u8_t)0x02)
#define CAN_EIER_BOFIE ((u8_t)0x04)
#define CAN_EIER_LECIE ((u8_t)0x10)
#define CAN_EIER_ERRIE ((u8_t)0x80)

#define CAN_TECR_TEC0 ((u8_t)0x01)
#define CAN_TECR_TEC1 ((u8_t)0x02)
#define CAN_TECR_TEC2 ((u8_t)0x04)
#define CAN_TECR_TEC3 ((u8_t)0x08)
#define CAN_TECR_TEC4 ((u8_t)0x10)
#define CAN_TECR_TEC5 ((u8_t)0x20)
#define CAN_TECR_TEC6 ((u8_t)0x40)
#define CAN_TECR_TEC7 ((u8_t)0x80)

#define CAN_RECR_REC0 ((u8_t)0x01)
#define CAN_RECR_REC1 ((u8_t)0x02)
#define CAN_RECR_REC2 ((u8_t)0x04)
#define CAN_RECR_REC3 ((u8_t)0x08)
#define CAN_RECR_REC4 ((u8_t)0x10)
#define CAN_RECR_REC5 ((u8_t)0x20)
#define CAN_RECR_REC6 ((u8_t)0x40)
#define CAN_RECR_REC7 ((u8_t)0x80)

#define CAN_FMR1_FML0 ((u8_t)0x01)
#define CAN_FMR1_FMH0 ((u8_t)0x02)
#define CAN_FMR1_FML1 ((u8_t)0x04)
#define CAN_FMR1_FMH1 ((u8_t)0x08)
#define CAN_FMR1_FML2 ((u8_t)0x10)
#define CAN_FMR1_FMH2 ((u8_t)0x20)
#define CAN_FMR1_FML3 ((u8_t)0x40)
#define CAN_FMR1_FMH3 ((u8_t)0x80)

#define CAN_FMR2_FML4 ((u8_t)0x01)
#define CAN_FMR2_FMH4 ((u8_t)0x02)
#define CAN_FMR2_FML5 ((u8_t)0x04)
#define CAN_FMR2_FMH5 ((u8_t)0x08)

#define CAN_FCR1_FACT0 ((u8_t)0x01)
#define CAN_FCR1_FACT1 ((u8_t)0x10)
#define CAN_FCR2_FACT2 ((u8_t)0x01)
#define CAN_FCR2_FACT3 ((u8_t)0x10)
#define CAN_FCR3_FACT4 ((u8_t)0x01)
#define CAN_FCR3_FACT5 ((u8_t)0x10)
#define CAN_FCR1_FSC00 ((u8_t)0x02)
#define CAN_FCR1_FSC01 ((u8_t)0x04)
#define CAN_FCR1_FSC10 ((u8_t)0x20)
#define CAN_FCR1_FSC11 ((u8_t)0x40)
#define CAN_FCR2_FSC20 ((u8_t)0x02)
#define CAN_FCR2_FSC21 ((u8_t)0x04)
#define CAN_FCR2_FSC30 ((u8_t)0x20)
#define CAN_FCR2_FSC31 ((u8_t)0x40)
#define CAN_FCR3_FSC40 ((u8_t)0x02)
#define CAN_FCR3_FSC41 ((u8_t)0x04)
#define CAN_FCR3_FSC50 ((u8_t)0x20)
#define CAN_FCR3_FSC51 ((u8_t)0x40)

struct stm8s_cfg
{
    volatile u8_t GCR;
};

#define CFG ((struct stm8s_cfg*) 0x7F60)

#define CFG_GCR_SWD ((u8_t)0x01)
#define CFG_GCR_AL ((u8_t)0x02)

#define DM ((struct stm8s_dm*) 0x7F90)

#endif
